iscle/Watch_nRF52840/src/displayapp/screens/ScreenDisplay.cpp
          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(tempCValue, ""); 
          lv_obj_set_style_local_text_font(tempCValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22); 
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -25, 40);
          break;
        case Modes::LowBattery:         
          batteryController.setGoToSleep(true);  
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &lowbattery);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, 0, 10); 
          timeoutCountStart = xTaskGetTickCount();
          /*
          tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_style_local_text_font(tempCValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_22);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, -20, 40);
          */
          break;

        case Modes::Oxi:
         
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &oxi);
          lv_obj_align(imgpair, NULL, LV_ALIGN_CENTER, -40, -10); 

          heartbeatValue = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(heartbeatValue, "--");
          lv_obj_set_style_local_text_font(heartbeatValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_40);  
          lv_obj_align(heartbeatValue, lv_scr_act(), LV_ALIGN_CENTER, 60, -25); 
          lv_obj_set_auto_realign(heartbeatValue, true);
          
          lablepercent = lv_label_create(lv_scr_act(), nullptr);
          lv_label_set_text(lablepercent, "");
          lv_obj_set_style_local_text_font(lablepercent, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_30);  
          lv_obj_align(lablepercent, lv_scr_act(), LV_ALIGN_CENTER, 85, -25); 

          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointoxi);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 

          lablebpm  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(lablebpm, &spo2);
          lv_obj_align(lablebpm, NULL, LV_ALIGN_CENTER, 61, 15); 

          textline1 = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(textline1, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_20);  
          lv_label_set_text(textline1, "Not for Medical Use"); 
          lv_obj_align(textline1, NULL, LV_ALIGN_CENTER, 0, 75); 

          /*textline2 = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(textline2, LV_LABEL_STYLE_MAIN, LabeltextStyle);
          lv_label_set_text(textline2, "Medical Purposes"); 
          lv_obj_align(textline2, NULL, LV_ALIGN_CENTER, 0, 85); 
          */
          heartRateSensor.SpO2Init();  

          break;
        case Modes::Temp:
          imgpair = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(imgpair, &temp);
          lv_obj_align(imgpair, nullptr, LV_ALIGN_CENTER, -40, -10); 

          /*tempCValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempCValue, true);
          lv_label_set_text(tempCValue, "--");
          lv_label_set_style( tempCValue,LV_LABEL_STYLE_MAIN,&labelStyle);
          lv_obj_align( tempCValue,lv_scr_act(), LV_ALIGN_CENTER, 50, 33);
          */

          tempFValue = lv_label_create(lv_scr_act(), nullptr);
          lv_obj_set_auto_realign(tempFValue, true);
          lv_label_set_text(tempFValue, "--");
          lv_obj_set_style_local_text_font(tempFValue, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_40);  
          lv_obj_align(tempFValue,lv_scr_act(), LV_ALIGN_CENTER, 60, -25);


          labelpoint  = lv_img_create(lv_scr_act(), NULL);  
          lv_img_set_src(labelpoint, &pointtemp);
          lv_obj_align(labelpoint, NULL, LV_ALIGN_IN_BOTTOM_MID, 0, 0); 

          lableftemp  = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(lableftemp , &ftemp);
          lv_obj_align(lableftemp , nullptr, LV_ALIGN_CENTER, 61, 15);


         /* lablectemp  = lv_img_create(lv_scr_act(), nullptr);  
          lv_img_set_src(lablectemp , &ctemp);
          lv_obj_align(lablectemp , nullptr, LV_ALIGN_CENTER, 50, 50);
          */

          heartRateSensor.HrInit();

          timeoutCountStart = xTaskGetTickCount();
          rawTemp=35.5f + (rand()% 3)/10.0f ;

          textline1 = lv_label_create(lv_scr_act(), NULL);
          lv_obj_set_style_local_text_font(textline1, LV_LABEL_PART_MAIN, LV_STATE_DEFAULT, &San_Francisco_20); 
          lv_label_set_text(textline1, "Not for Medical Use"); 
          lv_obj_align(textline1, NULL, LV_ALIGN_CENTER, 0, 75); 

          /*textline2 = lv_label_create(lv_scr_act(), NULL);
          lv_label_set_style(textline2, LV_LABEL_STYLE_MAIN, LabeltextStyle);
          lv_label_set_text(textline2, "Medical Purposes"); 
          lv_obj_align(textline2, NULL, LV_ALIGN_CENTER, 0, 85); 
          */
          break;
        default:
          break;
    }
 }

ScreenDisplay::~ScreenDisplay() {
  lv_obj_clean(lv_scr_act());
  //app->SetTouchMode(DisplayApp::TouchModes::Gestures);
  batteryController.setcheckVibrate(false);
  batteryController.setisButtonPushed(false);
  heartRateSensor.Disable();
  heartrate=0; 
  //tempSensor.stop();
}

bool ScreenDisplay::Refresh() {
    auto month =dateTimeController.Month();
    auto day = dateTimeController.Day();
    auto dayOfWeek = dateTimeController.DayOfWeek();
    auto hour =  dateTimeController.Hours();  
    auto minute =  dateTimeController.Minutes();  
    char timeStr[5];
    sprintf(timeStr, "%02d:%02d", static_cast<int>(hour), static_cast<int>(minute));     
        
    auto batteryPercent = batteryController.PercentRemaining();
    if(batteryPercent<25) lv_img_set_src(batteryIcon, &battery_05);
    else if(batteryPercent<50) lv_img_set_src(batteryIcon, &battery_20);
    else if(batteryPercent<75) lv_img_set_src(batteryIcon, &battery_50);
    else lv_img_set_src(batteryIcon, &battery_100);
    char strBat[4];
    sprintf (strBat, "%d", uint8_t(batteryPercent));
    if(batteryController.IsCharging())
    {
      lv_obj_set_hidden(batteryPlug,false);
    } else lv_obj_set_hidden(batteryPlug,true);

    if (bleController.IsConnected()) { lv_img_set_src(bleIcon, &bluetooth);} 
    else { lv_img_set_src(bleIcon, &bluetoothdis); }  
  
