iscle/Watch_nRF52840/src/displayapp/screens/ScreenDisplay.cpp
    lv_obj_align(batteryIcon, lv_scr_act(), LV_ALIGN_IN_TOP_RIGHT, -5, 5);
    lv_obj_align(bleIcon, batteryIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);
    lv_obj_align(batteryPlug, bleIcon, LV_ALIGN_OUT_LEFT_MID, -5, 0);

  switch (mode)  {
  case Modes::Clock: 
    char dateStr[15];
    sprintf(dateStr, "%s, %s %d", DayOfWeekToString(dayOfWeek),MonthToString(month),day);
    lv_label_set_text(label_date, dateStr); 
    lv_label_set_text(label_time, timeStr); 
  if((xTaskGetTickCount()-timeoutCountStart) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;
    break;
  case Modes::Test:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if((timeout>1*1024) & !checkTest) { 
      if(batteryController.PercentRemaining()<25) batteryController.setButtonDataNoVibrate(0x05); 
      else batteryController.setButtonDataNoVibrate(0x06);  
      checkTest=true;                 
    }
    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;

    break; 
    case Modes::CheckIn:   

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;

   if(batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()<3)) {             
        if(batteryController.isTimerDone1()||batteryController.getisButtonPushed()) {
            batteryController.setGoToSleep(true);         
            batteryController.setcheckVibrate(false); 
            batteryController.setisTimer1Done(false);         
          } else  batteryController.setcheckVibrate(true);

         if(batteryController.getcheckVibrate()) batteryController.setIsVibrate(); 
    }
    else if( batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() ==3)&& (batteryController.getCurrentSecond()<3)) {  
            batteryController.setButtonData(0x16); 
            batteryController.setIsAlert(0x16);       
            batteryController.setGoToSleep(true); 
            batteryController.StopVibrate() ;       
    } 
   
  
    if(batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute() <3)) {     
        if(batteryController.isTimerDone2()||batteryController.getisButtonPushed()) {         
            batteryController.setGoToSleep(true); 
            batteryController.setcheckVibrate(false); 
            batteryController.setisTimer2Done(false);      
          } else batteryController.setcheckVibrate(true);
         if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();  
    } else if( batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()==3)&&(batteryController.getCurrentSecond()<3)) {  
            batteryController.setButtonData(0x17); 
            batteryController.setIsAlert(0x17);       
            batteryController.setGoToSleep(true); 
            batteryController.StopVibrate();           
    } 

    break; 
    case Modes::Impact:
    timeout=xTaskGetTickCount()-timeoutCountStart;
    if(timeout<30*1024) { 
      if((batteryController.getimpactyy()==0x04) || batteryController.getisButtonPushed()) {
        batteryController.setcheckVibrate(false);
      } else batteryController.setcheckVibrate(true);
      if(batteryController.getcheckVibrate()) batteryController.setIsVibrate(); 
    } else if((timeout<31*1024) && !batteryController.getisButtonPushed()) batteryController.setButtonData(0x13); 

      if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;
/*    char strx[6];
    char stry[6];
    char strz[6];
    char strxmax[6];
    char strymax[6];
    char strzmax[6];
    char strg[6];
    sprintf(strx, "x:%d", batteryController.getx());
    sprintf(stry, "y:%d", batteryController.gety());
    sprintf(strz, "z:%d", batteryController.getz());
    sprintf(strxmax, "xm:%d", batteryController.getxmax());
    sprintf(strymax, "ym:%d", batteryController.getymax());
    sprintf(strzmax, "zm:%d", batteryController.getzmax());
    sprintf(strg, "gw:%d", uint8_t(batteryController.getAccData()*10));

    lv_label_set_text(x,strx); 
    lv_label_set_text(y,stry);
    lv_label_set_text(z,strz);
    lv_label_set_text(Xmax,strxmax); 
    lv_label_set_text(Ymax,strymax); 
    lv_label_set_text(Zmax,strzmax); 
    lv_label_set_text(gwatch,strg); 
*/

    break; 
    case Modes::Fall:
      timeout=xTaskGetTickCount()-timeoutCountStart; 
      if(timeout<30*1024) { 
        if (batteryController.getfallyy()==0x06|| batteryController.getisButtonPushed())  {
          batteryController.setcheckVibrate(false);
        } else batteryController.setcheckVibrate(true); 
      if(batteryController.getcheckVibrate()) batteryController.setIsVibrate();     
      } else if((timeout<31*1024) && !batteryController.getisButtonPushed()) batteryController.setButtonData(0x04);

    if((xTaskGetTickCount()-timeoutCountStartL) < 1.5*1024) {checkTouchBigButton = false;}
    if(checkTouchBigButton) {
          lv_obj_set_hidden(lableleftCircle,false);
          lv_obj_set_hidden(labletopCircle,false);
          lv_obj_set_hidden(lablerightCircle,false);

    } else {
          lv_obj_set_hidden(lableleftCircle,true);
          lv_obj_set_hidden(labletopCircle,true);
          lv_obj_set_hidden(lablerightCircle,true);
    }
    checkTouchBigButton = false;
/*
        char strxf[6];
        char stryf[6];
        char strzf[6];
        char strxmaxf[6];
        char strymaxf[6];
        char strzmaxf[6];
        char strgf[6];
        sprintf(strxf, "x:%d", batteryController.getx());
        sprintf(stryf, "y:%d", batteryController.gety());
        sprintf(strzf, "z:%d", batteryController.getz());
        sprintf(strxmaxf, "xm:%d", batteryController.getxmax());
        sprintf(strymaxf, "ym:%d", batteryController.getymax());
        sprintf(strzmaxf, "zm:%d", batteryController.getzmax());
        sprintf(strgf, "gw:%d", uint8_t(batteryController.getAccData()*10));

        lv_label_set_text(x,strxf); 
        lv_label_set_text(y,stryf);
        lv_label_set_text(z,strzf);
        lv_label_set_text(Xmax,strxmaxf); 
        lv_label_set_text(Ymax,strymaxf); 
        lv_label_set_text(Zmax,strzmaxf); 
        lv_label_set_text(gwatch,strgf); 
*/
    break; 
    case Modes::Sensor:

        heartrate=heartRateSensor.ReadHr();
        mod++;
        flag++;
        if(flag<50) {
           if(std::fmod(mod/5,5)) lv_label_set_text(heartbeatValue, "--");
           else lv_label_set_text(heartbeatValue, ""); 
           break;    
        } else flag =50;        
        char hr[4];
        if((heartrate<2) || (heartrate>180)) {
        if(std::fmod(mod/5,5)) lv_label_set_text(heartbeatValue, "--");
        else lv_label_set_text(heartbeatValue, "");     
        }
        else {sprintf(hr, "%d", heartrate); lv_label_set_text(heartbeatValue, hr);  }       
      
      break;

