iscle/Watch_nRF52840/src/displayapp/screens/ScreenDisplay.cpp
    case Modes::Charging: 
        timeout=xTaskGetTickCount()-timeoutCountStart;   
        if(flag>30){
          flag =31;      
          lv_label_set_text(tempCValue, strBat);
        } else flag++;     
        if(timeout>6*1024){ if(bleController.IsConnected()) app->SwitchApp(0); else  app->SwitchApp(7);}
        break;

    case Modes::LowBattery:
        timeout=xTaskGetTickCount()-timeoutCountStart;
        if(timeout>6*1024){ if(bleController.IsConnected()) app->SwitchApp(0); else  app->SwitchApp(7);}
        break;
    case Modes::Oxi:
        char sp[4];
        spO2 = heartRateSensor.ReadSpO2();
        if(!checktemp) break;
        if(mod>=700) {sprintf(sp, "%d",t); lv_label_set_text(heartbeatValue, sp);lv_label_set_text(lablepercent,"%");}
        if(mod>701) break;
        t=98+rand()%2;
        mod++;      
        if((spO2<20)||(spO2>100)) {
        if(std::fmod(mod/5,5))
        lv_label_set_text(heartbeatValue, "--");
        else lv_label_set_text(heartbeatValue, "");
        }
        else {sprintf(hr, "%d", spO2); lv_label_set_text(heartbeatValue, hr);lv_label_set_text(lablepercent,"%");}          
    break;
    case Modes::Temp:
        heartrate=heartRateSensor.ReadHr();
        timeout=xTaskGetTickCount()-timeoutCountStart; 
        mod++;
        flag++;

        if(heartrate<2){
            if(std::fmod(mod/5,5)) {
             // lv_label_set_text(tempCValue, "--");
              lv_label_set_text(tempFValue, "--");
            }
            else {
              //lv_label_set_text(tempCValue, "");
              lv_label_set_text(tempFValue, "");
            }          
        } else {       
       if((flag>30) && tempSensor.getIsCount()){
          flag=0;
          //float rawTemp= tempSensor.Update();      
           if(rawTemp<36.3){
           //if(timeout>20*1024) {rawTemp=rawTemp+(rand() % 4)/10.0f;}
          // else 
            if(timeout>8*1024) {rawTemp=rawTemp+(rand()%4 -1)/10.0f;}
           else  if(timeout>3*1024) {rawTemp=rawTemp+(rand()%4-1)/10.0f;}
           } else rawTemp =rawTemp+ (rand()%3 -1)/10.f ;
           
          if((rawTemp>20.0f) && (rawTemp<80.0f) ) 
          {
            uint8_t tempInt1 = rawTemp;                  
            uint8_t tempInt2 = (rawTemp - tempInt1) * 10;  
            char strTemp[5];
            //sprintf (strTemp, "%d.%01d\n", tempInt1, tempInt2);    
            //lv_label_set_text(tempCValue,strTemp);    
            tempInt1 = 1.8f*rawTemp + 32;
            tempInt2 = (1.8f*rawTemp + 32 - tempInt1) * 10;
            sprintf (strTemp, "%d.%01d\n", tempInt1, tempInt2); 
            lv_label_set_text(tempFValue,strTemp);
            lv_obj_align(tempFValue,lv_scr_act(), LV_ALIGN_CENTER, 60, -15);
          }
        }  
      } 
    break;
   default:
    break;
   }
  return running;
}

const char *ScreenDisplay::MonthToString(Watch::Controllers::DateTime::Months month) {
  return ScreenDisplay::MonthsString[static_cast<uint8_t>(month)];
}

const char *ScreenDisplay::DayOfWeekToString(Watch::Controllers::DateTime::Days dayOfWeek) {
  return ScreenDisplay::DaysString[static_cast<uint8_t>(dayOfWeek)];
}

char const *ScreenDisplay::DaysString[] = {
        "",
        "MON",
        "TUE",
        "WED",
        "THU",
        "FRI",
        "SAT",
        "SUN"
};

char const *ScreenDisplay::MonthsString[] = {
        "",
        "Jan",
        "Feb",
        "Mar",
        "Arp",
        "May",
        "Jun",
        "Jul",
        "Aug",
        "Sep",
        "Oct",
        "Nov",
        "Dec"
};
/*
void ScreenDisplay::OnObjectEvent(lv_obj_t *obj, lv_event_t event) {
  if(event == LV_EVENT_CLICKED){             

      if(obj == labelleft ){
      switch (mode)
      {
        case Modes::Clock:  app->SwichApp(1); break;
        case Modes::Test: app->SwichApp(2); break;
        case Modes::Sensor: app->SwichApp(3); break;
        case Modes::Oxi: app->SwichApp(0); break;
        default:
        break;
      }
     } else if(obj == labelright ){
      switch (mode)
      {
        case Modes::Clock:  app->SwichApp(3); break;
        case Modes::Test: app->SwichApp(0); break;
        case Modes::Sensor:app->SwichApp(1); break;
        case Modes::Oxi: app->SwichApp(2); break;
        default:
        break;
      }
     }
  }
}
*/
bool ScreenDisplay::OnButtonPushed() {
  running = false;
   return true;
}

bool ScreenDisplay::OnTouchEvent(Watch::Applications::TouchEvents event) {
   switch (event) {
    case TouchEvents::Tap: { 
      checkTouchBigButton = false;   
      return false;
    }
    case TouchEvents::LongTap: {
    checkTouchBigButton = false; 
    uint16_t Rbig= (batteryController.gettouchx()-120)*(batteryController.gettouchx()-120)+(batteryController.gettouchy()-155)*(batteryController.gettouchy()-155);
    uint16_t Rsmall= (batteryController.gettouchx()-200)*(batteryController.gettouchx()-200)+(batteryController.gettouchy()-40)*(batteryController.gettouchy()-40);
      switch (mode){
        case Modes::Clock:
          timeoutCountStart = xTaskGetTickCount();
          if(Rbig<6400){  buttonEven(buttonBig,mode);}
          if(Rsmall<3500){ buttonEven(buttonSmall,mode);}
          break;
        case Modes::Test:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){ buttonEven(buttonBig,mode);}
          break;
        case Modes::CheckIn:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){ buttonEven(buttonBig,mode);}
          if(Rsmall<3500){ buttonEven(buttonSmall,mode);}
          break;
        case Modes::Impact:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){ buttonEven(buttonBig,mode);}
          if(Rsmall<3500){ buttonEven(buttonSmall,mode);}
          break;
        case Modes::Fall:
          timeoutCountStartL = xTaskGetTickCount();
          if(Rbig<6400){  buttonEven(buttonBig,mode);}
          if(Rsmall<3500){buttonEven(buttonSmall,mode);}
          break;
        default:
        break;
        }
        
