iscle/Watch_nRF52840/src/displayapp/screens/ScreenDisplay.cpp
      return false;
    }
    default: {
      return false;
    }
  } 
}

void ScreenDisplay::buttonEven(lv_obj_t *obj, Modes mode){
   switch (mode)
   {
   case Modes::Clock:
        if(obj == buttonSmall ) {
            batteryController.setButtonData(0x02); 
            batteryController.setIsAlert(0x02);                   
        } else if(obj == buttonBig ) {
            batteryController.setButtonData(0x01);  
            batteryController.setIsAlert(0x01);                   
        }
        break;
   case Modes::Test:  
        if(obj ==  buttonBig )   batteryController.setButtonData(0x03);                   
        break;
   case Modes::CheckIn: 
        if(obj ==  buttonBig ) {
              batteryController.setGoToSleep(true); 
              batteryController.setcheckVibrate(false);
              batteryController.setisButtonPushed(true);                       
              if(batteryController.isTimerStart1() && (batteryController.getCheckinTime1()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()<3))  
              batteryController.setButtonData(0x14); 
              if(batteryController.isTimerStart2() && (batteryController.getCheckinTime2()== batteryController.getCurrentHour()) && ( batteryController.getCurrentMinute()<3)) 
              batteryController.setButtonData(0x15);          
          }
        else if(obj == buttonSmall ) {
             batteryController.setButtonData(0x01);
             batteryController.setcheckVibrate(false);
             //batteryController.setisButtonPushed(true);
             batteryController.setGoToSleep(true);
             }                
          break;
    case Modes::Impact:
          if(obj == buttonSmall) {
              batteryController.setButtonData(0x02);         
              batteryController.setcheckVibrate(false); 
              batteryController.setisButtonPushed(true);
              batteryController.setGoToSleep(true); 
              //batteryController.setXmax(0);
              //batteryController.setYmax(0);
              //batteryController.setZmax(0);     
          } else if(obj == buttonBig) {
              batteryController.setButtonData(0x13);     
              batteryController.setcheckVibrate(false);
              batteryController.setisButtonPushed(true); 
              batteryController.setGoToSleep(true);
          }
          break;
    case Modes::Fall:
          if(obj == buttonSmall) {
            batteryController.setButtonData(0x02); 
            batteryController.setcheckVibrate(false); 
            batteryController.setisButtonPushed(true); 
            batteryController.setGoToSleep(true);
            //batteryController.setXmax(0);
            //batteryController.setYmax(0);
            //batteryController.setZmax(0);       
          } else if(obj == buttonBig) {
              batteryController.setButtonData(0x04);       
              batteryController.setcheckVibrate(false);
              batteryController.setisButtonPushed(true); 
              batteryController.setGoToSleep(true);
          }
          break;
    default:
    break;
   }
}

bool ScreenDisplay::OnTouchEvent(uint16_t x, uint16_t y) {
  if((mode==Modes::Clock)||(mode==Modes::Test)||(mode==Modes::Impact)||(mode==Modes::Fall)||(mode==Modes::CheckIn)){
        if(((x-120)*(x-120)+(y-155)*(y-155))<4900){
              checkTouchBigButton = true;
      } else checkTouchBigButton = false;
  }  
  return false;
}
